[
    {
      "index": 0,
      "title": "Introduction",
      "description": "Short column is a compression member whose effective length is less than twelve times its least lateral dimension. In more general terms it is a compression member having a ratio of unsupported length to least dimension of the cross section equal to or less than 12. Generally, columns of circular or rectangular cross-sections are used in buildings. This chapter covers the design process of short rectangular columns."
    },
    {
      "index": 1,
      "title": "Short column subjected to axial loading",
      "description": "This section applies to columns that have the statically equivalent axial load P, at eccentricity less than the minimum eccentricity specified by the code.\n\nAxially loaded columns need to be designed keeping the provision of resisting some moments which normally is the situation in most of the practical columns. This is ensured by reducing the permissible stress in both concrete and steel during design.\n\nAs we know by the principles of solid mechanics the axial capacity of a structural member (P[u]) is equal to\n\nP[u]= maximum permissible normal stress of the material X the cross-sectional area of the member\n\nSince, RCC is a composite material, which is a combination of concrete and reinforcing steel we have\n\nP[u]=σ[c,permissible] A[c]+σ[s,permissible]A[sc]\n\nσ[c,permissible]: Maximum permissible normal stress of the concrete.\n\nA[c]: Cross-sectional area of the concrete.\n\nσ[s,permissible]: Maximum permissible normal stress of the steel.\n\nA[sc]: Cross-sectional area of the steel.\n\nThe maximum permissible normal stress (i.e. the design strength) of concrete is 0.446 f[ck] when the strain ranges from 0.002 to 0.0035. The maximum permissible normal stress (i.e. the design strength) of steel is 0.87 f[y].\n\nAs per clause 25.4 and 39.2 of IS 456:2000 all columns shall be designed with a minimum eccentricity. To take care of this requirement the design strengths of concrete and steel are further reduced to 0.4 f[ck] and 0.67 f[y], respectively. This reduction in the strength of concrete and steel takes care of the additional stresses that would be generated by the moments produced by accidental eccentricity and thus we need not check them separately.\n\nThus, for axially loaded short column the governing equation of design is:\n\nP[u]=0.4f[ck]A[c]+0.87f[y]A[sc]\n\nWhere,\n\nf[ck]: Characteristic strength of the concrete.\n\nA[c]: Cross-sectional area of the concrete.\n\nf[y]: Characteristic strength of the compression reinforcement.\n\nA[sc]: Cross-sectional area of the steel.\n\nNote: A[c] in the above equation is the area of concrete i.e. the total cross-sectional area of section minus the area of steel reinforcement.\n\nThis equation could be re-written in terms of gross cross-sectional area of section (A[g]) and percentage of reinforcement (p) as\n\nP[u] /A[g] = 0.4 f[ck] + (p/100) (0.67 f[y]-0.4f[ck])\n\nThis equation can be used for direct computation of A[g] when P[u], f[ck] and f[y] are known by assuming p ranging from 0.8 to 4 as the minimum and maximum percentages of longitudinal reinforcement."
    }
  ]