[
    {
      "index": 0,
      "title": "Introduction",
      "description": "<p>Short column is a compression member whose effective length is less than twelve times its least lateral dimension. In more general terms it is a compression member having a ratio of unsupported length to least dimension of the cross section equal to or less than 12. Generally, columns of circular or rectangular cross-sections are used in buildings. This chapter covers the design process of short rectangular columns.</p>"
    },
    {
      "index": 1,
      "title": "Short column subjected to axial load with Uni-axial Bending",
      "description": "<p>This section applies to columns that have the statically equivalent axial load P, at eccentricity in any one direction (major or minor but not both simultaneously) more than the minimum eccentricity specified by the code.</p>      <p>This kind of column should be specifically designed for both axial load and uniaxial bending moment. The structural capacity of a member in term of bending and shear varies with the variation in applied axial load. This implies that the strength of the section is just not dependent on material properties (elasticity) and sectional dimensions (Section Modulus) but also dependent on the load applied to the section. Therefore, the same column can carry several combinations of P and M in an interactive manner ranging from a condition of pure axial load(M=0) to pure bending moment case (P=0).</p>"
    },
    {
      "index": 2,
      "title": "Neutral Axis",
      "description": "<p>It is the axis along which the longitudinal stress in the member is zero. In the case of pure bending, neutral axis passes through the centroid of the section. But with the application of axial force, the location of neutral axis gets modified. On application of axial compression, the neutral axis shift towards the tensile face since the compressive stresses produced by the axial force counteract the tensile stresses produced by bending moment.</p><p>If there is no moment acting on the section (M=0) then the section is under axial compression only and the eccentricity (e=M/P) is zero. In this case, the neutral axis lies at infinity and the limiting strain permitted by the code across the section is 0.002.</p><p>Note: This value differs from the limiting strain of 0.0035 in flexural compression because in the case of flexure only the extreme compressive fiber is subjected to the limiting strain and the inner fibers still have sufficient capacity before the collapse. But in the case of uniform axial compression, the whole section is subjected to uniform strain and thus the limiting strain is considered 0.002.</p><p>If there is no axial force acting on the section (P=0) then the section is under pure bending and the eccentricity (e=M/P) is infinity. In this case, the neutral axis lies within the section. The limiting strain permitted by the code at the highly compressed fiber is 0.0035.</p><p>In the general case of uniaxial eccentric compression (<em>M</em>&ne; 0, <em>P</em>&ne; 0), the neutral axis varies from infinity to somewhere within the section. The distribution of the limiting strain profile depends on the location of the neural axis which in-turn depends on the magnitude of the applied load and moment.</p>"
    },
    {
      "index": 3,
      "title": "Modes of failure",
      "description": "<p>Failure is the loss of ability to function as intended. A column section fails when the strain reaches the value of limiting strain. The mode of failure depends on the eccentricity of loading. There are three modes of failure:</p><ul><li>Balanced failure:<br />The yielding of the outermost row of longitudinal steel on the tension side and the attainment of the maximum compressive strain in concrete &epsilon;<em><sub>cu </sub></em>= 0.0035 at the highly compressed edge of the column occur simultaneously.</li></ul><ul><li>Compression failure:<br />The crushing of concrete takes place before the yielding of the outermost row of longitudinal steel. This occurs when the eccentricity of the load P is less than that of balanced eccentricity (e &lt; e<sub>b</sub>) and the depth of the neutral axis is more than that of balanced failure.</li></ul><ul><li>Tension Failure:<br />The yielding of the outermost row of the longitudinal steel takes place before the crushing of concrete. This occurs when the eccentricity of the load P is more than that of balanced eccentricity (e &gt;e<sub>b</sub>) and the depth of the neutral axis is less than that of balanced failure.</li></ul>"
    },
    {
      "index": 4,
      "title": "Design Strength",
      "description": "<p>It is the load bearing capacity of the section before failure. In the case of column subjected to an axial force with uniaxial bending, the design strength is expressed in terms of Axial Strength (P<sub>u</sub>) and corresponding Bending Moment Capacity (M<sub>u</sub>). This carrying capacity in terms of a pair of P<sub>u</sub> and M<sub>u</sub>depends on the eccentricity of the load. The design strength of column subjected to an axial force with uniaxial bending is presented graphically for all the pairs of P<sub>u</sub> and M<sub>u</sub> with the help of interaction charts.</p>"
    },
    {
      "index": 5,
      "title": "Interaction Chart",
      "description": "<p>The interaction chart is a complete graphical representation of the design strength of a uniaxial eccentrically loaded column of given proportions. Each point on the curve corresponds to the design strength values of <em>P<sub>uR </sub></em>and <em>M</em><sub>u<em>R </em></sub>associated with a specific eccentricity (e) of loading. In other words, the design interaction curve serves as a failure envelope.</p><img src=\"Images/chapter_7/figure_7_1.png\" class=\"center\"/><p>Any point on the interaction diagram gives a unique pair of P<sub>u</sub> and M<sub>u</sub> that causes the state of incipient failure.</p><ul><li>Point-1: This represents the capacity of the section under pure axial compression. At this point e=0.</li><li>Point-2: This represents the pair of P<sub>u</sub> and M<sub>u</sub> that causes balanced failure. At this point e=e<sub>b</sub>.</li><li>Point-3: This represents the capacity of the section under pure bending. At this point e=&infin;.</li><li>Point-4: This represents the capacity of the section under pure axial tension. At this point e=0.</li></ul><p>The interaction diagram has three distinct zones of failure:</p><ul><li>Point 2 in the graph represents the balanced failure.Let e<sub>b</sub> be the eccentricity corresponding to balanced failure.</li><li>The zone above a radial line passing through origin O and point 2 is the zone of compression failure.The eccentricity of load causing compression failure would be always less than that required for balanced failure.</li><li>The zone above a radial line passing through origin O and point 2 is the zone of tension failure. The eccentricity of load causing tension failure would be always more than that required for balanced failure.</li></ul><p>In the compression failure zone, small eccentricities produce failure of concrete in compression, while in the tension failure zone large eccentricities cause failure triggered by yielding of tension steel.</p><p>The interaction diagram further reveals that as the axial force P<sub>u</sub> becomes larger the section can carry smaller M<sub>u</sub> before failing in the compression zone. The reverse is the case in the tension zone, where the moment carrying capacity M<sub>u</sub> increases with the increase of axial load P<sub>u</sub>.</p><p><em>In the compression failure zone, the failure occurs due to over straining of concrete. The large axial force produces high compressive stress in concrete which adds up to the bending compressive stress and reduces the bending tensile stresses. The increase in the overall compressive stress in the section leads to crushing of concrete.</em></p><p><em>&nbsp;On the other hand, in the tension failure zone, yielding of steel initiates failure.The large bending moment produces high bending tensile stress in the outermost layer of steel. This leads to yielding of the steel before crushing of concrete. </em></p>"
    },
    {
      "index": 6,
      "title": "Design Process",
      "description": "<p>The design of a column with given axial force and uniaxial bending moment should be done as follows:</p><ul><li>Selection of a trial section with assumed longitudinal steel,</li><li>Construction of the interaction diagram of the selected trial column section by successive choices of the neutral axis depth from infinity (pure axial load) to a very small value (to be found by trial to get P = 0 for pure bending),</li><li>If the applied axial load and applied bending moment fall within the diagram then the section is safe under applied loading condition.</li><li>If the applied axial load and applied bending moment fall outside the diagram then the section is not safe and should be revised.</li></ul>"
    }
  ]
